Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotSplitWhileBackgroundTasksAreInProgress
Cannot split element while background tasks are in progress.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotSplitElement
Can't split structural element

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotChangeTypeLineBased
Can't change type of "[Family Name]" from line based to non-line based or vice-versa.

Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotApplySplitWithGap
Can't make structural element.